Revit 2024 API
AddInIdAttribute.Value Property
AddInId guid value.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ValueType Value { get; }
Visual Basic
Public ReadOnly Property Value As ValueType
	Get
Visual C++
public:
property ValueType^ Value {
	ValueType^ get ();
}
See Also
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace